NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL81Z7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTMUX0</name>
      <description>Interrupt Multiplexer</description>
      <prependToName>INTMUX0_</prependToName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INTMUX0_0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>INTMUX0_1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>INTMUX0_2</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>INTMUX0_3</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPTMR1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>SPI1</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>EMVSIM1</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>I2C1</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TSI0</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>PMC</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>FTFA</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>MCG</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>WDOG_EWM</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>DAC0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>TRNG0</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>RTC_Alarm</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>59</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CH%s_CSR</name>
          <description>Channel n Control Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No operation.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Perform a software reset on this channel.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AND</name>
              <description>Logic AND</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Logic OR all enabled interrupt inputs.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Logic AND all enabled interrupt inputs.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQN</name>
              <description>Channel Input Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>32 interrupt inputs</description>
                  <value>#00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIN</name>
              <description>Channel Instance Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRQP</name>
              <description>Channel Interrupt Request Pending</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No interrupt is pending.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The interrupt output of this channel is pending.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CH%s_VEC</name>
          <description>Channel n Vector Number Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VECN</name>
              <description>Vector Number</description>
              <bitOffset>2</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CH%s_IER_31_0</name>
          <description>Channel n Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTE</name>
              <description>Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CH%s_IPR_31_0</name>
          <description>Channel n Interrupt Pending Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTP</name>
              <description>Interrupt Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No interrupt.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt is pending.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
