NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL81Z7.svd
        <register>
          <name>LTC0_PKA_29</name>
          <description>LTC PKHA A 29 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_14</name>
          <description>LTC PKHA A1 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_30</name>
          <description>LTC PKHA A 30 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_15</name>
          <description>LTC PKHA A1 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x87C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_31</name>
          <description>LTC PKHA A 31 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x87C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_0</name>
          <description>LTC PKHA A2 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_32</name>
          <description>LTC PKHA A 32 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_1</name>
          <description>LTC PKHA A2 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x884</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_33</name>
          <description>LTC PKHA A 33 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x884</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_2</name>
          <description>LTC PKHA A2 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x888</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_34</name>
          <description>LTC PKHA A 34 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x888</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_3</name>
          <description>LTC PKHA A2 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x88C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_35</name>
          <description>LTC PKHA A 35 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x88C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_4</name>
          <description>LTC PKHA A2 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x890</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_36</name>
          <description>LTC PKHA A 36 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x890</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_5</name>
          <description>LTC PKHA A2 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x894</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_37</name>
          <description>LTC PKHA A 37 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x894</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_6</name>
          <description>LTC PKHA A2 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x898</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_38</name>
          <description>LTC PKHA A 38 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x898</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_7</name>
          <description>LTC PKHA A2 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x89C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_39</name>
          <description>LTC PKHA A 39 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x89C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_8</name>
          <description>LTC PKHA A2 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_40</name>
          <description>LTC PKHA A 40 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_9</name>
          <description>LTC PKHA A2 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_41</name>
          <description>LTC PKHA A 41 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_10</name>
          <description>LTC PKHA A2 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_42</name>
          <description>LTC PKHA A 42 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_11</name>
          <description>LTC PKHA A2 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_43</name>
          <description>LTC PKHA A 43 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_12</name>
          <description>LTC PKHA A2 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_44</name>
          <description>LTC PKHA A 44 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_13</name>
          <description>LTC PKHA A2 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_45</name>
          <description>LTC PKHA A 45 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_14</name>
          <description>LTC PKHA A2 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_46</name>
          <description>LTC PKHA A 46 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA2_15</name>
          <description>LTC PKHA A2 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A2</name>
              <description>A2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_47</name>
          <description>LTC PKHA A 47 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_0</name>
          <description>LTC PKHA A3 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_48</name>
          <description>LTC PKHA A 48 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_1</name>
          <description>LTC PKHA A3 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_49</name>
          <description>LTC PKHA A 49 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_2</name>
          <description>LTC PKHA A3 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_50</name>
          <description>LTC PKHA A 50 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_3</name>
          <description>LTC PKHA A3 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_51</name>
          <description>LTC PKHA A 51 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA3_4</name>
          <description>LTC PKHA A3 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x8D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A3</name>
              <description>A3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
