NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL81Z7.svd
        <register>
          <name>LTC0_PKN_39</name>
          <description>LTC PKHA N 39 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_8</name>
          <description>LTC PKHA N2 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_40</name>
          <description>LTC PKHA N 40 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_9</name>
          <description>LTC PKHA N2 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_41</name>
          <description>LTC PKHA N 41 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_10</name>
          <description>LTC PKHA N2 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_42</name>
          <description>LTC PKHA N 42 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_11</name>
          <description>LTC PKHA N2 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_43</name>
          <description>LTC PKHA N 43 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_12</name>
          <description>LTC PKHA N2 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_44</name>
          <description>LTC PKHA N 44 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_13</name>
          <description>LTC PKHA N2 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_45</name>
          <description>LTC PKHA N 45 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_14</name>
          <description>LTC PKHA N2 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_46</name>
          <description>LTC PKHA N 46 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN2_15</name>
          <description>LTC PKHA N2 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N2</name>
              <description>N2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_47</name>
          <description>LTC PKHA N 47 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_0</name>
          <description>LTC PKHA N3 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_48</name>
          <description>LTC PKHA N 48 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_1</name>
          <description>LTC PKHA N3 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_49</name>
          <description>LTC PKHA N 49 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_2</name>
          <description>LTC PKHA N3 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_50</name>
          <description>LTC PKHA N 50 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_3</name>
          <description>LTC PKHA N3 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_51</name>
          <description>LTC PKHA N 51 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_4</name>
          <description>LTC PKHA N3 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_52</name>
          <description>LTC PKHA N 52 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_5</name>
          <description>LTC PKHA N3 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_53</name>
          <description>LTC PKHA N 53 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_6</name>
          <description>LTC PKHA N3 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_54</name>
          <description>LTC PKHA N 54 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_7</name>
          <description>LTC PKHA N3 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_55</name>
          <description>LTC PKHA N 55 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_8</name>
          <description>LTC PKHA N3 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_56</name>
          <description>LTC PKHA N 56 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_9</name>
          <description>LTC PKHA N3 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_57</name>
          <description>LTC PKHA N 57 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_10</name>
          <description>LTC PKHA N3 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_58</name>
          <description>LTC PKHA N 58 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_11</name>
          <description>LTC PKHA N3 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_59</name>
          <description>LTC PKHA N 59 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_12</name>
          <description>LTC PKHA N3 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_60</name>
          <description>LTC PKHA N 60 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_13</name>
          <description>LTC PKHA N3 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_61</name>
          <description>LTC PKHA N 61 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_14</name>
          <description>LTC PKHA N3 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
