NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL81Z7.svd
        <register>
          <name>LTC0_PKN_62</name>
          <description>LTC PKHA N 62 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN3_15</name>
          <description>LTC PKHA N3 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N3</name>
              <description>N3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_63</name>
          <description>LTC PKHA N 63 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xCFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_0</name>
          <description>LTC PKHA E0 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_0</name>
          <description>LTC PKHA E 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_1</name>
          <description>LTC PKHA E0 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_1</name>
          <description>LTC PKHA E 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_2</name>
          <description>LTC PKHA E0 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_2</name>
          <description>LTC PKHA E 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_3</name>
          <description>LTC PKHA E0 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_3</name>
          <description>LTC PKHA E 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_4</name>
          <description>LTC PKHA E0 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_4</name>
          <description>LTC PKHA E 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_5</name>
          <description>LTC PKHA E0 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_5</name>
          <description>LTC PKHA E 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_6</name>
          <description>LTC PKHA E0 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_6</name>
          <description>LTC PKHA E 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_7</name>
          <description>LTC PKHA E0 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_7</name>
          <description>LTC PKHA E 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_8</name>
          <description>LTC PKHA E0 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_8</name>
          <description>LTC PKHA E 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_9</name>
          <description>LTC PKHA E0 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_9</name>
          <description>LTC PKHA E 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_10</name>
          <description>LTC PKHA E0 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_10</name>
          <description>LTC PKHA E 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_11</name>
          <description>LTC PKHA E0 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_11</name>
          <description>LTC PKHA E 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_12</name>
          <description>LTC PKHA E0 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_12</name>
          <description>LTC PKHA E 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_13</name>
          <description>LTC PKHA E0 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_13</name>
          <description>LTC PKHA E 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_14</name>
          <description>LTC PKHA E0 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_14</name>
          <description>LTC PKHA E 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE0_15</name>
          <description>LTC PKHA E0 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E0</name>
              <description>E0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_15</name>
          <description>LTC PKHA E 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_0</name>
          <description>LTC PKHA E1 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_16</name>
          <description>LTC PKHA E 16 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_1</name>
          <description>LTC PKHA E1 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_17</name>
          <description>LTC PKHA E 17 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_2</name>
          <description>LTC PKHA E1 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_18</name>
          <description>LTC PKHA E 18 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_3</name>
          <description>LTC PKHA E1 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_19</name>
          <description>LTC PKHA E 19 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_4</name>
          <description>LTC PKHA E1 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_20</name>
          <description>LTC PKHA E 20 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE1_5</name>
          <description>LTC PKHA E1 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xE54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E1</name>
              <description>E1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
