NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL81Z7.svd
        <register>
          <name>LTC0_PKE_44</name>
          <description>LTC PKHA E 44 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_13</name>
          <description>LTC PKHA E2 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_45</name>
          <description>LTC PKHA E 45 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_14</name>
          <description>LTC PKHA E2 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_46</name>
          <description>LTC PKHA E 46 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE2_15</name>
          <description>LTC PKHA E2 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E2</name>
              <description>E2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_47</name>
          <description>LTC PKHA E 47 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_0</name>
          <description>LTC PKHA E3 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_48</name>
          <description>LTC PKHA E 48 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_1</name>
          <description>LTC PKHA E3 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_49</name>
          <description>LTC PKHA E 49 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_2</name>
          <description>LTC PKHA E3 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_50</name>
          <description>LTC PKHA E 50 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_3</name>
          <description>LTC PKHA E3 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xECC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_51</name>
          <description>LTC PKHA E 51 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xECC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_4</name>
          <description>LTC PKHA E3 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_52</name>
          <description>LTC PKHA E 52 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_5</name>
          <description>LTC PKHA E3 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_53</name>
          <description>LTC PKHA E 53 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_6</name>
          <description>LTC PKHA E3 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_54</name>
          <description>LTC PKHA E 54 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xED8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_7</name>
          <description>LTC PKHA E3 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_55</name>
          <description>LTC PKHA E 55 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_8</name>
          <description>LTC PKHA E3 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_56</name>
          <description>LTC PKHA E 56 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_9</name>
          <description>LTC PKHA E3 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_57</name>
          <description>LTC PKHA E 57 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_10</name>
          <description>LTC PKHA E3 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_58</name>
          <description>LTC PKHA E 58 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_11</name>
          <description>LTC PKHA E3 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_59</name>
          <description>LTC PKHA E 59 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_12</name>
          <description>LTC PKHA E3 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_60</name>
          <description>LTC PKHA E 60 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_13</name>
          <description>LTC PKHA E3 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_61</name>
          <description>LTC PKHA E 61 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_14</name>
          <description>LTC PKHA E3 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_62</name>
          <description>LTC PKHA E 62 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKE3_15</name>
          <description>LTC PKHA E3 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_E3</name>
              <description>E3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKE_63</name>
          <description>LTC PKHA E 63 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xEFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
